---
type: Duct
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 8
tags: [revit-api, class]
---

# Duct

`Autodesk.Revit.DB.Mechanical.Duct` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | CreatePlaceholder | 2014 | `public static Duct CreatePlaceholder ( Document document , ElementId systemTypeId , ElementId ductTypeId , ElementId levelId , XYZ startPoint , XYZ endPoint )` |
| Method | IsDuctTypeId | 2011 | `public static bool IsDuctTypeId ( Document document , ElementId ductTypeId )` |
| Method | IsHvacSystemTypeId | 2014 | `public static bool IsHvacSystemTypeId ( Document document , ElementId systemTypeId )` |
| Method | SetSystemType | 2017 | `public void SetSystemType ( ElementId systemTypeId )` |
| Property | DuctType | — | `public DuctType DuctType { get ; set ; }` |
| Property | IsPlaceholder | — | `public bool IsPlaceholder { get ; }` |
| Property | Parameter | — | `` |